Catalogs/рс_Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_Объекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_ВидОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>рс_Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_ТабличныеЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>рс_Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Модули</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Модуль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Модули</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Модули</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Детализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_ПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рс_Объекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПоследняяСсылкаДетализации;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоследняяСсылкаДетализации = Неопределено;
	ПодключитьОбработчикОжидания("ОбновлятьДетализациюПоТекущейСтроке", 0.5);
	ОбновлятьДетализациюПоТекущейСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОтключитьОбработчикОжидания("ОбновлятьДетализациюПоТекущейСтроке");
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьДетализациюПоТекущейСтроке() Экспорт
	ТекущаяСтрока = Элементы.Расширения.ТекущиеДанные;
	НоваяСсылка = Неопределено;
	Если ТекущаяСтрока <> Неопределено Тогда
		НоваяСсылка = ТекущаяСтрока.Детализация;
	КонецЕсли;

	Если СсылкиСовпадают(НоваяСсылка, ПоследняяСсылкаДетализации) Тогда
		Возврат;
	КонецЕсли;

	ПоследняяСсылкаДетализации = НоваяСсылка;
	Если ЗначениеЗаполнено(НоваяСсылка) Тогда
		Элементы.ПросмотрДетализации.Значение = ПолучитьТекстПрисоединенногоФайлаНаСервере(НоваяСсылка);
	Иначе
		Элементы.ПросмотрДетализации.Значение = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СсылкиСовпадают(ЛеваяСсылка, ПраваяСсылка)
	Если ЛеваяСсылка = Неопределено И ПраваяСсылка = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если ЛеваяСсылка = Неопределено Или ПраваяСсылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ЛеваяСсылка = ПраваяСсылка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДетализациюИзФайла(Команда)
	ТекущаяСтрока = Элементы.Расширения.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Выберите строку табличной части Расширения.");
		Возврат;
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите текстовый файл";
	Диалог.Фильтр = "Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	Попытка
		ТекстовыйДокумент.Прочитать(Диалог.ПолноеИмяФайла);
	Исключение
		Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ФайлСсылка = СоздатьПрисоединенныйФайлНаСервере(Диалог.ПолноеИмяФайла, ТекстФайла);
	ТекущаяСтрока.Детализация = ФайлСсылка;
	ПоследняяСсылкаДетализации = Неопределено;
	ОбновлятьДетализациюПоТекущейСтроке();
КонецПроцедуры

&НаСервере
Функция СоздатьПрисоединенныйФайлНаСервере(Знач ПолноеИмяФайла, Знач ТекстФайла)
	//НовыйФайл = Справочники.рс_ПрисоединенныеФайлы.СоздатьЭлемент();
	//НовыйФайл.Наименование = Новый Файл(ПолноеИмяФайла).Имя;
	//НовыйФайл.ИмяФайла = ПолноеИмяФайла;
	//НовыйФайл.Содержимое = Новый ХранилищеЗначения(ТекстФайла);
	//НовыйФайл.Записать();

	//Возврат НовыйФайл.Ссылка;
КонецФункции

&НаКлиенте
Процедура ПоказатьДетализацию(Команда)
	ОбновлятьДетализациюПоТекущейСтроке();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстПрисоединенногоФайлаНаСервере(Знач СсылкаНаФайл)
	Если Не ЗначениеЗаполнено(СсылкаНаФайл) Тогда
		Возврат "";
	КонецЕсли;

	ОбъектФайла = СсылкаНаФайл.ПолучитьОбъект();
	Если ТипЗнч(ОбъектФайла.Содержимое) = Тип("ХранилищеЗначения") Тогда
		Возврат ОбъектФайла.Содержимое.Получить();
	КонецЕсли;

	Возврат "";
КонецФункции
